app/views/posts/index.html.erb

SELECT  "users".* FROM "users"  ORDER BY "users"."id" DESC LIMIT 1
---
Последний зарегистрированный пользователь:  <%= User.last.name %><br>