app/controllers/posts_controller.rb

	def show
		@post = Post.where(id: params[:id]).first
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY "posts"."id" ASC LIMIT 1  [["id", 3]]